{
  "main": {
    "name":"Pareesh Madan",
    "description":"Hard-Working Software Engineer and Computer Science Student at the University of Guelph",
    "image":"picturewebsite.jpg",
    "bio" : "I have always been fascinated with the boundless and infinite capabilities of computers which motivated me to pursue a future in Computer Science. Currently pursing internship oppurtunities for Winter 2026.",
    "contactmessage":"Feel free to email me at madanp@uoguelph.ca or call me at 519-362-1324",
    "email": "madanp@uoguelph.ca",
    "phone": "519-362-1324",
    "github":"https://github.com/PareeshMadan",
    "project":"https://github.com/PareeshMadan/react-nice-resume",
    "address":{
      "street":"(Your Street)",
      "city":"(Your City)",
      "state":"(Your State)",
      "zip": "(Your Zip/Postal Code)"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload":"PMResumeF2026 Alt.pdf",
    "social":[
      {
        "name":"facebook",
        "url":"https://github.com/nordicgiant2/react-nice-resume",
        "className":"fa fa-facebook"
      },
      {
        "name":"twitter",
        "url":"http://twitter.com",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/tim-baker-8420009a/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"http://instagram.com/tbaker_x",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/nordicgiant2/react-nice-resume",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"",
    "education":[
      {
        "school":"University of Guelph",
        "degree":"Bachelor of Computer Science, Business Data Analytics Minor (Co-op)",
        "graduated":"Class of 2028",
        "description":"Relevant Courses: OOP, Data Structures, Software System Development & Integration, Operating Systems",
        "description2": "90% Cumulative GPA, Academic Scholarship."
      }
    ],
    "work":[
      {
        "company": "CIBC",
        "title": "Software Engineer Co-op",
        "years": "May 2025 - August 2025",
        "description": "During my Software Engineer Co-op at CIBC, I supported the QA team in writing and maintaining functional test cases for middleware and infrastructure tools. I learned the structure and standards for creating test cases, contributed several that were validated and used by the team, and participated in test reviews to improve quality and coverage. This strengthened my critical thinking and problem-solving skills by anticipating edge cases and identifying potential failures. While I was not directly assigned coding work, I gained exposure to automation scripts and internal workflows, participated in peer reviews, and contributed ideas for potential improvements. I also enhanced my oral communication skills by providing updates in team stand-ups, documenting incidents, and clearly sharing progress with both technical and non-technical stakeholders. Feedback from team leads confirmed that my communication was effective and valuable for team alignment.",
        "description2": "CIBC (Canadian Imperial Bank of Commerce) is one of Canada’s largest banks, headquartered in Toronto, serving clients globally with a strong focus on financial services and technology innovation. This co-op term gave me first-hand experience in quality assurance and infrastructure support in a professional banking environment. Through my goals, I developed problem-solving abilities, deepened my understanding of technological literacy, and strengthened oral communication skills. Although I was not able to fully achieve my scripting goal, exposure to automation practices broadened my knowledge of industry standards. Overall, this work term reinforced the importance of collaboration, critical thinking, and adaptability, preparing me for future co-op opportunities and professional roles in software engineering."
      },
      {
        "company":"Bio-imaging Research Solutions Inc.",
        "title":"Software Developer Intern",
        "years":"May 2024 - August 2024",
        "description":"Developed a prototype neural network using TensorFlow for image classification to detect diseases in cow lymph nodes, trained on a dataset of over 3,500 annotated DICOM-formatted X-ray images.",
        "description2":"Designed and implemented a Python-based image format converter program, streamlining the preprocessing of DICOM images for training the neural network."
      }
    ],
    "skills":[
      {
        "name":"JAVA",
        "level":"80%"
      },
      {
        "name":"C/C++",
        "level":"80%"
      },
      {
        "name":"JavaScript",
        "level":"70%"
      },
      {
        "name":"Python",
        "level":"70%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Pathfinding Visualiser",
        "category":"",
        "image":"path.png",
        "url":"https://github.com/PareeshMadan/PathfindingVisualizer"
      },
      {
        "title":"Zelda-Reimagined",
        "category":"",
        "image":"zeldavid.gif",
        "url":"https://github.com/PareeshMadan/Zelda-Reimagined"
      },
      {
        "title":"Penguin-Climb",
        "category":"",
        "image":"pengvid.gif",
        "url":"https://github.com/PareeshMadan/Penguin-Climb"
      },
      {
        "title":"Pokemon-Team-Builder",
        "category":"",
        "image":"pkmn.png",
        "url":"https://pokemon-team-builder-2025-8a06b02d19a6.herokuapp.com/"
      }
    ]
  }
}